IOmsgData/simpl/supermarket/purchaseRequest.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:fut="http://futuremarket.ime.usp.br/">
   <soapenv:Header/>
   <soapenv:Body>
      <fut:purchase>
         <arg0>product1</arg0>
         <arg1>
            <endpoint></endpoint>
            <id></id>
            <name></name>
            <zipcode></zipcode>
         </arg1>
      </fut:purchase>
   </soapenv:Body>
</soapenv:Envelope>